In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dataset=pd.read_csv('car_dataset.csv')

In [3]:
dataset.head(2)

,name,selling_price,km_driven,fuel,transmission,owner,mileage,engine,seats,year
0,Maruti Swift Dzire VDI,450000,145500,Diesel,Manual,First Owner,23.4 kmpl,1248 CC,5.0,2014
1,Skoda Rapid 1.5 TDI Ambition,370000,120000,Diesel,Manual,Second Owner,21.14 kmpl,1498 CC,5.0,2014

In [7]:
dataset.shape

(8128, 10)

In [8]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8128 entries, 0 to 8127
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           8128 non-null   object
 1   selling_price  8128 non-null   int64
 2   km_driven      8128 non-null   int64
 3   fuel           8128 non-null   object
 4   transmission   8128 non-null   object
 5   owner          8128 non-null   object
 6   mileage        7907 non-null   object
 7   engine         7907 non-null   object
 8   seats          7907 non-null   float64
 9   year           8128 non-null   int64
dtypes: float64(1), int64(3), object(6)
memory usage: 635.1+ KB

In [9]:
dataset.isnull()

,name,selling_price,km_driven,fuel,transmission,owner,mileage,engine,seats,year
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
8123,False,False,False,False,False,False,False,False,False,False
8124,False,False,False,False,False,False,False,False,False,False
8125,False,False,False,False,False,False,False,False,False,False
8126,False,False,False,False,False,False,False,False,False,False
8127,False,False,False,False,False,False,False,False,False,False

In [11]:
(dataset.isnull().sum()/dataset.shape[0])*100

name             0.000000
selling_price    0.000000
km_driven        0.000000
fuel             0.000000
transmission     0.000000
owner            0.000000
mileage          2.718996
engine           2.718996
seats            2.718996
year             0.000000
dtype: float64

In [13]:
dataset.dropna(inplace=True)

In [14]:
(dataset.isnull().sum()/dataset.shape[0])*100

name             0.0
selling_price    0.0
km_driven        0.0
fuel             0.0
transmission     0.0
owner            0.0
mileage          0.0
engine           0.0
seats            0.0
year             0.0
dtype: float64

name

In [17]:
x=dataset['name'][0]
x[:x.index(" ")]

'Maruti'

In [22]:
def company_name(x):
     return x[:x.index(" ")]

In [26]:
def car_name(x):
     return x[x.index(" ")+1:]

In [24]:
dataset["company_name"]=dataset["name"].apply(company_name)

In [27]:
dataset["name"]=dataset["name"].apply(car_name)

In [28]:
dataset.head(3)

,name,selling_price,km_driven,fuel,transmission,owner,mileage,engine,seats,year,company_name
0,Swift Dzire VDI,450000,145500,Diesel,Manual,First Owner,23.4 kmpl,1248 CC,5.0,2014,Maruti
1,Rapid 1.5 TDI Ambition,370000,120000,Diesel,Manual,Second Owner,21.14 kmpl,1498 CC,5.0,2014,Skoda
2,City 2017-2020 EXi,158000,140000,Petrol,Manual,Third Owner,17.7 kmpl,1497 CC,5.0,2006,Honda

In [33]:
dataset["selling_price"]=dataset["selling_price"].astype("float64")

In [34]:
dataset["km_driven"]=dataset["km_driven"].astype("int64")

In [37]:
dataset["engine"]=dataset["engine"].str.replace("CC","")
dataset["engine"]=dataset["engine"].astype("int64")

In [38]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7907 entries, 0 to 8127
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           7907 non-null   object
 1   selling_price  7907 non-null   float64
 2   km_driven      7907 non-null   int64
 3   fuel           7907 non-null   object
 4   transmission   7907 non-null   object
 5   owner          7907 non-null   object
 6   mileage        7907 non-null   object
 7   engine         7907 non-null   int64
 8   seats          7907 non-null   float64
 9   year           7907 non-null   int64
 10  company_name   7907 non-null   object
dtypes: float64(2), int64(3), object(6)
memory usage: 999.3+ KB

In [39]:
dataset.head(2)

,name,selling_price,km_driven,fuel,transmission,owner,mileage,engine,seats,year,company_name
0,Swift Dzire VDI,450000.0,145500,Diesel,Manual,First Owner,23.4 kmpl,1248,5.0,2014,Maruti
1,Rapid 1.5 TDI Ambition,370000.0,120000,Diesel,Manual,Second Owner,21.14 kmpl,1498,5.0,2014,Skoda

In [40]:
dataset['seats']

0       5.0
1       5.0
2       5.0
3       5.0
4       5.0
       ...
8123    5.0
8124    5.0
8125    5.0
8126    5.0
8127    5.0
Name: seats, Length: 7907, dtype: float64

In [42]:
dataset["seats"]=dataset["seats"].astype("int64")

In [53]:
dataset.head(2)

,name,selling_price,km_driven,fuel,transmission,owner,mileage,engine,seats,year,company_name
0,Swift Dzire VDI,450000.0,145500,Diesel,Manual,First Owner,23.4 kmpl,1248,5,2014,Maruti
1,Rapid 1.5 TDI Ambition,370000.0,120000,Diesel,Manual,Second Owner,21.14 kmpl,1498,5,2014,Skoda

In [52]:
dataset["year"]=dataset["year"].astype("int64")